[
	{
		"title" : "Robot",
        "shorttitle" : "Robot",
		"doctor" : "Tom Baker",
		"villians" : "Giant Robot",
		"season" : "12",
		"prodnum" : "4a",
		"transnum" : "4a",
		"companions" : "Sarah, Harry, Brigadier, Benton",
		"synopsis" : "When the secret plans to a disintegrator gun are stolen by what appears to have been some kind of giant robot, the newly-regenerated Doctor is quickly called in to investigate. The trail leads to a group of right-wing scientists at the Thinktank facility, who are seeking to use the robot and the disintegrator gun to impose their edicts on humanity. As the situation escalates, Sarah Jane may prove to be the Doctor's only means of influencing the robot."
	},
	{
		"title" : "The Ark In Space",
        "shorttitle" : "TheArkInSpace",
		"doctor" : "Tom Baker",
		"villians" : "Wirrn",
		"season" : "12",
		"prodnum" : "4c",		
		"transnum" : "4b",
		"companions" : "Sarah, Harry",
		"synopsis" : "The TARDIS brings the Doctor, Sarah and Harry to the Nerva Beacon in the far future, where the remnants of humanity have been placed in suspended animation because of the risk of deadly solar flares on Earth. The humans have overslept by millennia, however, due to the incursion of the insect-like Wirrn. More Wirrn are gestating within Noah, the Beacon's leader, and as Noah starts to succumb to the alien influence, the human race faces imminent extinction.."
	},
	{
		"title" : "The Sontaran Experiment",
        "shorttitle" : "TheSontaranExperiment",
		"doctor" : "Tom Baker",
		"villians" : "Sontaran",
		"season" : "12",
		"prodnum" : "4b",				
		"transnum" : "4c",
		"companions" : "Sarah, Harry",
		"synopsis" : "The Doctor agrees to transmat down to Earth to make sure everything is okay before the Nerva survivors begin to reclaim their planet. There, he, Sarah Jane and Harry discover the presence of a Sontaran named Styre, who is performing cruel experiments on a band of captive humans. Styre's goal is to discover the weaknesses of the human body -- weaknesses the Sontarans will then exploit in their quest to dominate the universe."
	},
	{
		"title" : "Genesis Of The Daleks",
        "shorttitle" : "GenesisOfTheDaleks",
		"doctor" : "Tom Baker",
		"villians" : "Daleks",
		"season" : "12",
		"prodnum" : "4e",				
		"transnum" : "4d",
		"companions" : "Sarah, Harry",
		"synopsis" : "The Time Lords intercept the Doctor, Sarah and Harry as they transmat back to Nerva, and send them to Skaro in the distant past in order to prevent the creation of the Daleks. There they discover the planet's two native races, the Kaleds and the Thals, are nearing the climax of the Thousand Year War. As the conflict reaches its terrible conclusion, Sarah discovers that a disfigured Kaled scientist named Davros has already accomplished what the time travellers were sent to stop: the genesis of the Daleks."
	},
	{
		"title" : "Revenge Of The Cybermen",
        "shorttitle" : "RevengeOfTheCybermen",
		"doctor" : "Tom Baker",
		"villians" : "Cybermen",
		"season" : "12",
		"prodnum" : "4d",				
		"transnum" : "4e",
		"companions" : "Sarah, Harry",
		"synopsis" : "The Doctor, Sarah and Harry return to the Nerva Beacon, but inadvertently appear thousands of years before they left. Whilst awaiting the arrival of the TARDIS, they discover the Beacon -- at this point in time used to direct interstellar traffic -- is overrun by a plague which has wiped out most of the crew. The culprits are the Cybermen, on a vendetta to destroy the deciding factor in humanity's war against them: Voga, the Planet of Gold."
	},
	{	
		"title" : "Terror Of The Zygons",
        "shorttitle" : "TerrorOfTheZygons",
		"doctor" : "Tom Baker",
		"villians" : "Zygons",
		"season" : "13",
		"prodnum" : "4f",				
		"transnum" : "4f",
		"companions" : "Sarah, Harry, Brigadier, Benton",
		"synopsis" : "The Brigadier summons the Doctor back to Earth to investigate mysterious goings-on around Loch Ness in Scotland. The Doctor, Sarah Jane and Harry discover that the Loch Ness Monster is no myth -- in fact, it is really the Skarasen, a cybernetic reptile used as a servant by shape-shifting aliens known as the Zygons. The Zygons are paving the way for an invasion of Earth, and have already used their powers to infiltrate the local authorities."
	},
	{	
		"title" : "Planet Of Evil",
        "shorttitle" : "PlanetOfEvil",
		"doctor" : "Tom Baker",
		"villians" : "Antimatter Monster, Antiman (Sorenson), Commander Salamar",
		"season" : "13",
		"prodnum" : "4h",				
		"transnum" : "4g",
		"companions" : "Sarah",
		"synopsis" : "The Doctor and Sarah land on Zeta Minor, at the very edge of the universe. A scientific team led by Professor Sorenson is being terrified by an anti-matter monster, a situation which deteriorates when Sorenson takes a sample of anti-matter off-planet. The Doctor must stop Sorenson, who has begun mutating into a Jekyll-and-Hyde-like anti-man, and restore the balance on Zeta Minor before death comes calling for them all."
	},
	{	
		"title" : "Pyramids Of Mars",
        "shorttitle" : "PyramidsOfMars",
		"doctor" : "Tom Baker",
		"villians" : "Sutekh, Mummies, Marcus Scarman",
		"season" : "13",
		"prodnum" : "4g",				
		"transnum" : "4h",
		"companions" : "Sarah",
		"synopsis" : "It is 1911, and the TARDIS lands in the home of sibling scientists Laurence and Marcus Scarman. Laurence desperately needs the Doctor's help, since his brother has been behaving very oddly ever since returning from an archaeological dig in Egypt. To confuse matters further, Laurence has begun detecting strange radio signals from the surface of Mars. The Doctor discovers that Marcus has become the avatar on Earth of Sutekh, a powerful alien Osirian imprisoned centuries earlier by his people for his terrible crimes. Now Sutekh is using Marcus to regain his freedom, and herald the end of the world."
	},
	{	
		"title" : "The Android Invasion",
        "shorttitle" : "TheAndroidInvasion",
		"doctor" : "Tom Baker",
		"villians" : "Kraals, Androids",
		"season" : "13",
		"prodnum" : "4j",				
		"transnum" : "4j",
		"companions" : "Sarah, Harry, Benton",
		"synopsis" : "The TARDIS seems to have returned the Doctor and Sarah Jane to modern-day England, but it quickly becomes apparent that something is very wrong: the people behave oddly, the calendar has just one day on it, coins are all minted from the same date. The time travellers soon realise that they are not on Earth at all, but on a simulacrum created by the Kraals, who are using the replicated village to help them prepare for their imminent invasion of Earth."
	},
	{	
		"title" : "The Brain Of Morbius",
        "shorttitle" : "TheBrainOfMorbius",
		"doctor" : "Tom Baker",
		"villians" : "Morbius, The Sisterhood of Kaan, Solon",
		"season" : "13",
		"prodnum" : "4k",				
		"transnum" : "4k",
		"companions" : "Sarah",
		"synopsis" : "The Time Lords divert the Doctor and Sarah to Karn. The planet is home to the Sisterhood of the Flame, whose sacred fire -- which provides an elixir granting them eternal life and is used by the Time Lords to aid in regenerative crises -- is slowly dying. The Sisterhood believes the Doctor has come to steal the vestiges of the elixir and has him captured. Also on Karn, meanwhile, is the mad Doctor Solon, who has covertly taken possession of the brain of Morbius, an evil Time Lord thought to have been executed. Solon is trying to build a new body for Morbius, and is lacking only a suitable head: the head of a Time Lord."
	},
	{	
		"title" : "The Seeds Of Doom",
        "shorttitle" : "TheSeedsOfDoom",
		"doctor" : "Tom Baker",
		"villians" : "Krynoid, Harrison Chase, Scorby",
		"season" : "13",
		"prodnum" : "4l",				
		"transnum" : "4l",
		"companions" : "Sarah",
		"synopsis" : "An Antarctic expedition unearths two pods which the Doctor recognises as Krynoids. Once germinated, the pods will infect humans, turning them into giant carnivorous plants which will quickly overrun the world. The Doctor and Sarah Jane manage to destroy one Krynoid, but the other is stolen by an insane botanist named Harrison Chase, who intends to use the alien entity to help plants take over the world."
	},
	{	
		"title" : "The Masque Of Mandragora",
        "shorttitle" : "TheMasqueOfMandragora",
		"doctor" : "Tom Baker",
		"villians" : "Helix Energy, Count Federico, Hieronymous",
		"season" : "14",
		"prodnum" : "4m",				
		"transnum" : "4m",
		"companions" : "Sarah",
		"synopsis" : "The TARDIS accidentally transports the Mandragora Helix, a malevolent energy being, to Italy during the Renaissance. There, the Doctor and Sarah Jane become embroiled in court intrigue between the wicked Count Federico and his nephew, Giuliano. Meanwhile, the Helix gains the loyalty of the twisted astrologer Hieronymous, and plans to return humanity to the Dark Ages by murdering the great thinkers of the fifteenth century."
	},	
	{	
		"title" : "The Hand Of Fear",
        "shorttitle" : "TheHandOfFear",
		"doctor" : "Tom Baker",
		"villians" : "Eldrad",
		"season" : "14",
		"prodnum" : "4n",				
		"transnum" : "4n",
		"companions" : "Sarah",
		"synopsis" : "An explosion in a quarry unearths a calcified hand, which is inadvertently discovered by Sarah. The hand contains the consciousness of a silicon-based alien called Eldrad, who seizes control of Sarah's mind and compels her to break into a nuclear reactor, where he is able to regenerate his entire body. Eldrad then convinces the Doctor to return him to his homeworld of Kastria, from which he claims to have been wrongfully exiled. But there is far more to Eldrad's past than he is letting on..."
	},	
	{	
		"title" : "The Deadly Assassin",
        "shorttitle" : "TheDeadlyAssassin",
		"doctor" : "Tom Baker",
		"villians" : "The Master, Chancellor Goth",
		"season" : "14",
		"prodnum" : "4p",				
		"transnum" : "4p",
		"companions" : "None",
		"synopsis" : "The President of the High Council of the Time Lords is assassinated, and the Doctor, newly returned to Gallifrey, is the prime suspect. But the Doctor knows someone is framing him, and must rely on the help of the reluctant Castellan Kelner to unveil a traitor in the High Council. Ultimately, the trail leads to the dying, vengeful Master, who wishes to harness the powers of Rassilon's greatest discovery, the mythical Eye of Harmony. But to do so would mean the destruction of Gallifrey, and to prevent this, the Doctor must risk his life in the surreal landscape of the Matrix."
	},	
	{	
		"title" : "The Face Of Evil",
        "shorttitle" : "TheFaceOfEvil",
		"doctor" : "Tom Baker",
		"villians" : "The Sevateem, Xoanon",
		"season" : "14",
		"prodnum" : "4q",				
		"transnum" : "4q",
		"companions" : "Leela",
		"synopsis" : "The TARDIS lands on a planet where the population is divided into two warring factions: the barbaric Sevateem and the brilliant Tesh. The Doctor himself is regarded as a demon by the Sevateem, and to the Time Lord's consternation, he discovers that a giant carving of the Evil One is in fact a replica of his own head. With the help of a Sevateem warrior named Leela, the Doctor discovers that the Sevateem god, Xoanon, is really a schizophrenic computer, whose malfunction is the fault of the Doctor himself."
	},	
	{	
		"title" : "The Robots Of Death",
        "shorttitle" : "TheRobotsOfDeath",
		"doctor" : "Tom Baker",
		"villians" : "Dask, Robots",
		"season" : "14",
		"prodnum" : "4r",				
		"transnum" : "4r",
		"companions" : "Leela",
		"synopsis" : "The TARDIS brings the Doctor and Leela to a Sandminer, a giant mining ship. The crew of the Sandminer is slowly being killed off one by one, and the time travellers are the obvious suspects. But the Doctor discovers that the impossible is coming true: the Sandminer's robot workers and manservants are responsible for the deaths, having fallen under the influence of the crazed scientist Taren Capel, who wishes to supplant the human race with his robotic creations."
	},	
	{	
		"title" : "The Talons Of Weng-Chiang",
        "shorttitle" : "TheTalonsOfWeng-Chiang",
		"doctor" : "Tom Baker",
		"villians" : "Li H'sen Chang, Magnus Greel",
		"season" : "14",
		"prodnum" : "4s",				
		"transnum" : "4s",
		"companions" : "Leela",
		"synopsis" : "The Doctor and Leela find themselves in Victorian London. Girls are being kidnapped off the street, ghosts have been sighted in the opera house run by Henry Jago, and giant rats haunt the London sewers. At the centre of the chaos is a mysterious Oriental magician named Li H'sen Chang. Chang serves a man he believes is the god Weng-Chiang, and is searching for a cabinet lost by his master. The Doctor uncovers the truth, however -- Weng-Chiang is actually Magnus Greel, a tyrant from the 60th century whose escape back through time has transformed him into a disfigured monster."
	},	
	{	
		"title" : "Horror Of Fang Rock",
        "shorttitle" : "HorrorOfFangRock",
		"doctor" : "Tom Baker",
		"villians" : "Ruton",
		"season" : "15",
		"prodnum" : "4v",				
		"transnum" : "4t",
		"companions" : "Leela",
		"synopsis" : "The TARDIS materialises near a lighthouse on an island in the English Channel, where a boat carrying several high-society passengers has just capsized. The lighthouse itself has suffered mysterious energy drains and the death of one of its technicians. The Doctor and Leela discover that a shapeshifting Rutan has infiltrated the island and is about to summon its mothership to Earth. As the lighthouse's occupants are killed off one by one it appears that, this time, the Doctor may be too late to save anyone."
	},	
	{	
		"title" : "The Invisible Enemy",
        "shorttitle" : "TheInvisibleEnemy",
		"doctor" : "Tom Baker",
		"villians" : "The Nucleus of the Swarm",
		"season" : "15",
		"prodnum" : "4t",				
		"transnum" : "4v",
		"companions" : "Leela, K9",
		"synopsis" : "A parasite infects the Doctor whilst the TARDIS is hovering in space, and begins to slowly take over his mind. While the Doctor places himself in a coma to stall the organism, Leela takes the Time Lord to a medical facility on Titan in the far future. There, with the help of Professor Marius and his robot dog K-9, Leela has miniaturised clones of herself and the Doctor created, so that they can travel into the Doctor's brain and take the battle to the parasite itself."
	},	
	{	
		"title" : "Image Of The Fendahl",
        "shorttitle" : "ImageOfTheFendahl",
		"doctor" : "Tom Baker",
		"villians" : "The Fendahl, Dr. Fendahlman",
		"season" : "15",
		"prodnum" : "4x",				
		"transnum" : "4w",
		"companions" : "Leela",
		"synopsis" : "The activation of a time scanner draws the Doctor, Leela and K-9 to modern-day Earth, where a team of scientists has uncovered an ancient skull. The skull is that of the Fendahl, a creature which thrives on death and which was thought to have been destroyed by the Time Lords. One of the scientists, Thea Ransome, is converted into a host for the Fendahl, and she creates minions -- the deadly Fendahleen -- to deliver her lethal message across the planet."
	},	
	{	
		"title" : "The Sun Makers",
        "shorttitle" : "TheSunMakers",
		"doctor" : "Tom Baker",
		"villians" : "The Gatherer, The Collector",
		"season" : "15",
		"prodnum" : "4w",				
		"transnum" : "4x",
		"companions" : "Leela, K9",
		"synopsis" : "The TARDIS lands on Pluto in the far future, where the Doctor is astonished to find the planet inhabited by humans and heated by a number of miniature suns. He, Leela and K-9 discover that the human race has been moved off Earth to do the bidding of the Company, a ruthless intergalactic conglomerate. It is up to the Doctor to uncover the secret of the Company's head, the Collector, while Leela is sentenced to death by steaming."
	},	
	{	
		"title" : "Underworld",
        "shorttitle" : "Underworld",
		"doctor" : "Tom Baker",
		"villians" : "Seers, The Oracle",
		"season" : "15",
		"prodnum" : "4y",				
		"transnum" : "4y",
		"companions" : "Leela, K9",
		"synopsis" : "The Doctor, Leela and K-9 find themselves in a spacecraft piloted by the last of the Minyans, a race which destroyed itself using technology given to them by early Time Lords. Now the remaining Minyans are on a desperate search for their race banks, lost centuries earlier, which represent the only hope for the survival of their civilisation. With the Doctor's help, the race banks are located. But in order to retrieve them, the time travellers must confront an insane computer and its robotic servants, or the Minyans will be forever doomed."
	},	
	{	
		"title" : "The Invasion Of Time",
        "shorttitle" : "TheInvasionOfTime",
		"doctor" : "Tom Baker",
		"villians" : "Vardans, Sontarans",
		"season" : "15",
		"prodnum" : "4z",				
		"transnum" : "4z",
		"companions" : "Leela, K9",
		"synopsis" : "The Doctor returns to Gallifrey, having become President of the High Council following an illicit deal with aliens known as the Vardans. He has Leela exiled to the wastes beyond the Capitol, where she allies herself with outcast Time Lords living as savages. Leela believes the Doctor has turned traitor, but in fact he is masterminding an elaborate plan to unveil the identity of the Vardans' masters, and foil a scheme to invade Gallifrey itself."
	},	
	{	
		"title" : "The Ribos Operation",
        "shorttitle" : "TheRibosOperation",
		"doctor" : "Tom Baker",
		"villians" : "Graff Vynda-K",
		"season" : "16",
		"prodnum" : "5a",				
		"transnum" : "5a",
		"companions" : "Romana, K9",
		"synopsis" : "The Doctor is called upon by the White Guardian, the embodiment of order and light, to find the six disguised segments of the Key To Time -- scattered throughout time and space -- so that the Guardian can restore the faltering universal balance. To this end, the White Guardian provides the Doctor with a new assistant in the form of the young Time Lady Romana. Their first destination is Ribos, a mediaeval-style planet which a con man named Garron is trying to sell to the megalomaniacal Graff Vynda-K. When the Graff uncovers Garron's treachery, the crook's assistant, Unstoffe, flees into the monster-infested Catacombs, little realising that amongst his possessions is the first segment of the Key To Time."
	},	
	{	
		"title" : "The Pirate Planet",
        "shorttitle" : "ThePiratePlanet",
		"doctor" : "Tom Baker",
		"villians" : "The Captain, xanxia",
		"season" : "16",
		"prodnum" : "5b",				
		"transnum" : "5b",
		"companions" : "Romana, K9",
		"synopsis" : "The Doctor and Romana head to the planet Calufrax in search of the second segment of the Key To Time. Inexplicably, however, the TARDIS lands on Zanak. The Doctor discovers that Zanak is a pirate planet, materialising around other worlds and reaping their mineral wealth. The leader of this operation is the crazed Captain, who is prepared to take Zanak onto its next conquest: Earth."
	},	
	{	
		"title" : "The Stones Of Blood",
        "shorttitle" : "TheStonesOfBlood",
		"doctor" : "Tom Baker",
		"villians" : "The Cailleach, The Ogre",
		"season" : "16",
		"prodnum" : "5c",				
		"transnum" : "5c",
		"companions" : "Romana, K9",
		"synopsis" : "The quest for the third segment of the Key To Time takes the TARDIS to modern-day Earth, near a stone circle called the Nine Maidens. The circle has been the site of renewed worship of a Druidic goddess called the Cailleach, and has also attracted the interest of archaeologist Emilia Rumford. When someone tries to kill Romana, the Doctor realises that something is amiss at the Nine Maidens, and that the Cailleach may not be quite as mythical as he believed."
	},	
	{	
		"title" : "The Androids Of Tara",
        "shorttitle" : "TheAndroidsOfTara",
		"doctor" : "Tom Baker",
		"villians" : "Count Grendel",
		"season" : "16",
		"prodnum" : "5d",				
		"transnum" : "5d",
		"companions" : "Romana, K9",
		"synopsis" : "While the Doctor has a rest, Romana finds the fourth segment of the Key To Time on Tara, only to be kidnapped by the villainous Count Grendel. It transpires that Romana is an exact double of Tara's Princess Strella. Grendel has aspirations to the Taran throne, and has kidnapped Strella in an attempt to force her to marry him; now he believes he can make Romana pose as Strella and accomplish the deception that way. But the Doctor allies himself with Reynart, Strella's true love, in a desperate attempt to stop the throne from falling into Grendel's cruel grasp."
	},	
	{	
		"title" : "The Power Of Kroll",
        "shorttitle" : "ThePowerOfKroll",
		"doctor" : "Tom Baker",
		"villians" : "The Swampies, Rohm-Dut, Thawn",
		"season" : "16",
		"prodnum" : "5e",				
		"transnum" : "5e",
		"companions" : "Romana, K9",
		"synopsis" : "For the fifth segment of the Key To Time, the Doctor and Romana travel to the marsh moon of Delta Magna. There, the time travellers become enmeshed in tensions between the barbaric native Swampies, the gun-runner Rohm-Dutt, and the crew of a refinery which is trying to drive the Swampies away. In the midst of all this, the Swampie god, a gargantuan squid named Kroll, is beginning to stir, and even the Doctor will be defenseless in the wake of the destruction wrought by Kroll."

	},	
	{	
		"title" : "The Armageddon Factor",
        "shorttitle" : "TheArmageddonFactor",
		"doctor" : "Tom Baker",
		"villians" : "The Black Guardian, The Shadow",
		"season" : "16",
		"prodnum" : "5f",				
		"transnum" : "5f",
		"companions" : "Romana, K9",
		"synopsis" : "The Black Guardian, the embodiment of evil and darkness, is closing in as the Doctor, Romana and K-9 go in search of the sixth and final segment of the Key To Time on the wartorn planet Atrios. Atrios is in a state of perpetual conflict with its neighbour, Zeos, and the planet's entire civilisation is being held together only through the tireless efforts of Princess Astra. But it soon becomes clear that there is more to the Atrios-Zeos war than meets the eye, and discovering the key to the mystery may become the deciding factor in the Doctor's quest for the Key To Time."
	},	
	{	
		"title" : "Destiny Of The Daleks",
        "shorttitle" : "DestinyOfTheDaleks",
		"doctor" : "Tom Baker",
		"villians" : "Daleks, Movellans",
		"season" : "17",
		"prodnum" : "5J",				
		"transnum" : "5g",
		"companions" : "Romana, K9",
		"synopsis" : "Having installed a Randomiser in the TARDIS to avoid the attentions of the Black Guardian, the Doctor and the newly-regenerated Romana find themselves on a bleak planet the Doctor is sure he has visited before. The two are separated in a cave-in, and Romana finds herself a captive of the Doctor's oldest foes, the Daleks. The Doctor encounters the Daleks' enemies, the ruthless android Movellans, who reveal that the planet is in fact Skaro. The Daleks are searching for their long-lost creator, Davros, in an attempt to shatter the stalemate in the Dalek-Movellan war."
	},	
	{	
		"title" : "City Of Death",
        "shorttitle" : "CityOfDeath",
		"doctor" : "Tom Baker",
		"villians" : "Count Scarlioni",
		"season" : "17",
		"prodnum" : "5h",				
		"transnum" : "5h",
		"companions" : "Romana, K9",
		"synopsis" : "In modern-day Paris, the Doctor and Romana realise that someone is playing with time. They trace the disturbances to Count Scarlioni, who is actually one of several fragments of an alien Jagaroth named Scaroth. Scaroth's ship exploded on primordial Earth, scattering shards of his being throughout history. Now Scaroth has accumulated the funds and technology to send himself back in time to avert the accident. But the Doctor realises that this would prevent the evolution of life on Earth, which was instigated by the explosion."
	},	
	{	
		"title" : "The Creature From The Pit",
        "shorttitle" : "TheCreatureFromThePit",
		"doctor" : "Tom Baker",
		"villians" : "Adrasta, Erato",
		"season" : "17",
		"prodnum" : "5g",				
		"transnum" : "5j",
		"companions" : "Romana, K9",
		"synopsis" : "The planet Chloris is plentiful in vegetation but barren of metal. When the Doctor, Romana and K-9 arrive, Chloris' leader, the wicked Adrasta, has the Doctor thrown into a pit at the bottom of which an enormous green monster is supposed to dwell. The Doctor discovers that the monster is actually Erato, an ambassador from Tythonus who came to Chloris to trade metal for agriculture and was banished to the pit because Adrasta feared losing her monopoly on metal. But this revelation may come too late, as the Tythonians are en route to Chloris, ready to ravage the planet to avenge Adrasta's treatment of their envoy."
	},	
	{	
		"title" : "Nightmare Of Eden",
        "shorttitle" : "NightmareOfEden",
		"doctor" : "Tom Baker",
		"villians" : "Mandrels, Tryst",
		"season" : "17",
		"prodnum" : "5k",				
		"transnum" : "5k",
		"companions" : "Romana, K9",
		"synopsis" : "Two spaceships collide in hyperspace, fusing the vessels together. Investigating the accident, the Doctor, Romana and K-9 meet Tryst, an eccentric scientist who is carrying samples of various planets within a machine called the Continuous Event Transmuter. The CET malfunctions, however, unleashing monstrous Mandrels onto both ships. Meanwhile, the time travellers discover that someone on board has been smuggling the illicit, addictive drug vraxoin -- and it becomes clear that the disastrous events are not unrelated."
	},	
	{	
		"title" : "The Horns Of Nimon",
        "shorttitle" : "TheHornsOfNimon",
		"doctor" : "Tom Baker",
		"villians" : "Nimons",
		"season" : "17",
		"prodnum" : "5l",				
		"transnum" : "5l",
		"companions" : "Romana, K9",
		"synopsis" : "The Doctor and Romana discover a stricken space vessel transporting seven young people from the planet Aneth to Skonnos. The Time Lords are forced to help repair the ship, even though the Anethans are fated to be sacrificed to the bull-like Nimon, who has promised the Skonnans great prosperity. On Skonnos, however, the Doctor learns that the Nimon is actually a member of a race of intergalactic locusts, who ravage each world foolish enough to believe their lies."
	},	
	{	
		"title" : "Shada",
        "shorttitle" : "Shada",
		"doctor" : "Tom Baker",
		"villians" : "Skagra",
		"season" : "17",
		"prodnum" : "5m",				
		"transnum" : "5m",
		"companions" : "Romana, K9",
		"synopsis" : "The Doctor, Romana and K-9 visit an old friend, a retired Time Lord named Professor Chronotis now living as a professor in Cambridge. There they encounter the evil scientist Skagra, who has come to steal a Gallifreyan text in Chronotis' possession. With the book, Skagra can locate Shada, the Gallifreyan prison planet, where he intends to force Salyavin, a Time Lord criminal with vast mental powers, to help him imprint his mind upon every being in the cosmos."
	},	
	{	
		"title" : "The Leisure Hive",
        "shorttitle" : "TheLeisureHive",
		"doctor" : "Tom Baker",
		"villians" : "Foamasi, ",
		"season" : "18",
		"prodnum" : "5n",				
		"transnum" : "5n",
		"companions" : "Romana, K9",
		"synopsis" : "In search of a holiday, the Doctor and Romana travel to the famous Leisure Hive on Argolis, a planet ravaged by a nuclear war with the reptilian Foamasi years earlier. The main attraction of the Hive is a device called the Tachyon Recreation Generator, but when things start to go mysteriously wrong with the machine, the Doctor realises that evil is afoot in the Hive. He and Romana begin to unearth a tangled conspiracy which may lead to a new, deadlier war between the Argolins and the Foamasi."
	},	
	{	
		"title" : "Meglos",
        "shorttitle" : "Meglos",
		"doctor" : "Tom Baker",
		"villians" : "Meglos, ",
		"season" : "18",
		"prodnum" : "5q",				
		"transnum" : "5p",
		"companions" : "Romana, K9",
		"synopsis" : "The Doctor is summoned back to the planet Tigella, where the population is divided along religious and scientific lines. Something is going terribly wrong with Tigella's main power source, the Dodecahedron, but the Savants are prevented from investigating by the zealous Deons. To make matters worse, before the Doctor can solve the problem with the Dodecahedron, he is accused of its theft. The true culprit is Meglos, a shapeshifting Zolfa-Thuran, who intends to unleash the full might of the Dodecahedron upon the universe."
	},	
	{	
		"title" : "Full Circle",
        "shorttitle" : "FullCircle",
		"doctor" : "Tom Baker",
		"villians" : "Marshmen, e-space",
		"season" : "18",
		"prodnum" : "5r",				
		"transnum" : "5q",
		"companions" : "Romana, K9, Adric",
		"synopsis" : "Romana is recalled to Gallifrey, but en route the TARDIS is drawn through a Charged Vacuum Emboitment into another universe, called E-Space. Landing on the planet Alzarius, the Doctor meets a group of humans who are trying to rebuild their spacecraft -- which crashlanded generations ago -- so they can return to their native Terradon. When Marshmen begin rising from the swamps during the dreaded time of Mistfall, however, the Doctor realises that there is something amiss on Alzarius, and begins to unravel a genetic riddle which stretches back centuries."
	},	
	{	
		"title" : "State Of Decay",
        "shorttitle" : "StateOfDecay",
		"doctor" : "Tom Baker",
		"villians" : "Vampires, e-space",
		"season" : "18",
		"prodnum" : "5p",				
		"transnum" : "5r",
		"companions" : "Romana, K9, Adric",
		"synopsis" : "Still trapped in E-Space, the TARDIS materialises on a mediaeval planet. The townsfolk live in fear of the Three Who Rule, who govern from their mighty castle. Investigating, the Doctor discovers that the Three Who Rule are ancient astronauts who were turned into vampires long ago, and their castle is actually their spaceship. When Romana and Adric are kidnapped, the Doctor must ally himself with a band of renegade peasants to stop the resurrection of one of Gallifrey's greatest enemies: the Great Vampire itself."
	},	
	{	
		"title" : "Warriors' Gate",
        "shorttitle" : "WarriorsGate",
		"doctor" : "Tom Baker",
		"villians" : "Rorvik, e-space",
		"season" : "18",
		"prodnum" : "5s",				
		"transnum" : "5s",
		"companions" : "Romana, K9, Adric",
		"synopsis" : "Trying to escape from E-Space, the Doctor, Romana, Adric and K-9 instead land in an eerie white void whose only feature is a crumbling old keep. Also trapped in the void is a privateering ship captained by the cruel Rorvik, whose time sensitive pilot, the leonine Tharil Biroc, escapes and lures the Doctor into the keep and the mirror gateway beyond. There, the Doctor witnesses the rise and fall of the once-mighty Tharil Empire. He realises that he must free the Tharils enslaved on the privateering ship and escape through the gateway, before Rorvik's vengeful actions destroy them all."
	},	
	{	
		"title" : "The Keeper Of Traken",
        "shorttitle" : "TheKeeperOfTraken",
		"doctor" : "Tom Baker",
		"villians" : "Melkur/The Master",
		"season" : "18",
		"prodnum" : "5t",				
		"transnum" : "5t",
		"companions" : "Adric",
		"synopsis" : "The Union of Traken is governed by a Keeper gifted with the powers of the Source. The current Keeper is nearing the end of his thousand-year tenure, however, and asks the Doctor and Adric -- who have escaped from E-Space -- to go to Traken and stop an evil he believes is plotting to destroy the Union. But the source of the evil, the Melkur, has already infiltrated the Consuls of Traken, and has the Doctor declared a criminal. Allying himself with Consul Tremas and his daughter, Nyssa, the Time Lord must uncover the true power behind the Melkur -- someone who knows the Doctor of old."
	},	
	{	
		"title" : "Logopolis",
        "shorttitle" : "Logopolis",
		"doctor" : "Tom Baker",
		"villians" : "The Master",
		"season" : "18",
		"prodnum" : "5v",				
		"transnum" : "5v",
		"companions" : "Adric",
		"synopsis" : "After her aunt is murdered by the Master, an airline stewardess named Tegan Jovanka becomes an unwitting stowaway aboard the TARDIS as it travels to the planet Logopolis. There, the Doctor discovers that the Master's interference with the Logopolitans' advanced mathematics has unleashed a wave of entropy which threatens to consume the entire universe. The two Time Lords enter into an uneasy alliance, together with Adric, Tegan and Nyssa, who has travelled to Logopolis to confront the Master. Their only hope lies on Earth... but then, in the moment of greatest crisis, the Master plays his ultimate trump card."
	}
]